# 1. تحديد النسخة الرسمية والخفيفة من لغة بايثون كبيئة أساسية
FROM python:3.10-slim

# 2. تحديد مجلد العمل الافتراضي داخل الحاوية المعزولة
WORKDIR /app

# 3. نسخ ملف الاعتماديات أولاً لداخل الحاوية
COPY requirements.txt .

# 4. تثبيت مكتبة Flask تلقائياً داخل بيئة بايثون المعزولة
RUN pip install --no-cache-dir -r requirements.txt

# 5. نسخ باقي ملفات المشروع (مثل ملف app.py) إلى داخل الحاوية
COPY . .

# 6. إخبار الحاوية بفتح المنفذ رقم 5000 لاستقبال زوار الموقع
EXPOSE 5000

# 7. الأمر النهائي الذي سيقوم بتشغيل التطبيق بمجرد تشغيل الحاوية
CMD ["python", "app.py"]